app/Controllers/Auth.php

public function verifyOtp()
{
    $otp = $this->request->getPost('otp');
    $userModel = new UserModel();
    // Find the user by OTP
    $user = $userModel->where('otp', $otp)->first();
    if ($user) {
        // Update the user's verification status and clear the OTP
        $userModel->update($user['id'], ['is_verified' => 1, 'otp' => null]);
---
SELECT *
FROM `users`
WHERE `otp` = '282850'
 LIMIT 1
UPDATE `users` SET `is_verified` = 1, `otp` = NULL
WHERE `users`.`id` IN ('8')

public function registerUser()
{
    //Users Input Validation
    $validated = $this->validate([
        'name' => 'required',
        'email' => 'required|valid_email|is_unique[users.email]',
        'password' => 'required|min_length[5]|max_length[12]',
        'passwordConf' => 'required|min_length[5]|max_length[12]|matches[password]',
    ]);
    if (!$validated) {
        return view('auth/register', ['validation' => $this->validator]);
    }
    $data = [
        'name' => $this->request->getPost('name'),
        'email' => $this->request->getPost('email'),
        'password' => password_hash($this->request->getPost('password'), PASSWORD_DEFAULT),
        'is_verified' => 0, // Set verification status to 0
        'otp' => rand(100000, 999999), // Generate a random OTP
    ];
    $userModel = new UserModel();
    $userModel->insert($data);
---
INSERT INTO `users` (`name`, `email`, `password`, `is_verified`, `otp`) VALUES ('thomas', 'thomaseshetu1992@gmail.com', '$2y$10$SmtGOQrTcpXKmb2DXwjOuuqBRYPFjkJYdHV5ZiVhpbO2Ih1JutyHG', 0, 282850)

    public function loginUser()
    {
        // Validate User Input Data
        $validated = $this->validate([
            'email' => 'required|valid_email',
            'password' => 'required|min_length[5]|max_length[12]',
        ]);
        if (!$validated) {
            return view('auth/login', ['validation' => $this->validator]);
        }
        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');
        $userModel = new UserModel();
        // Retrieve the user by email
        $user = $userModel->where('Email', trim($email))->first();
---
SELECT *
FROM `users`
WHERE `Email` = 'alemayehuamsaya95@gmail.com'
 LIMIT 1

public function dashboard()
{
    // Check if the user is logged in
    if (!session()->get('logged_in')) {
        return redirect()->to('/auth')->with('fail', 'You must log in first.');
    }
    // Get user details from the session
    $userModel = new UserModel();
    $user = $userModel->find(session()->get('user_id'));
    // Fetch user's blog posts
    $blogModel = new BlogModel();
    $user_blogs = $blogModel->where('user_id', session()->get('user_id'))->findAll();
---
SELECT *
FROM `users`
WHERE `users`.`id` = '4'
SELECT *
FROM `blogs`
WHERE `user_id` = '4'