app/Controllers/BlogController.php

SELECT *
FROM `blogs`
---
        public function index()
    {
        $data['blogs'] = $this->blogModel->findAll();

SELECT *
FROM `blogs`
WHERE `blogs`.`id` = '25'
SELECT *
FROM `likes`
WHERE `blog_id` = '25'
SELECT *
FROM `comments`
WHERE `blog_id` = '25'
SELECT *
FROM `blogs`
WHERE `id` != '25'
 LIMIT 3
---
        public function view($id)
    {
        $blog = $this->blogModel->find($id);
        if (!$blog) {
        throw new \CodeIgniter\Exceptions\PageNotFoundException('Blog post not found'); }
        $likes = $this->likeModel->where('blog_id', $id)->findAll();
        $comments = $this->commentModel->where('blog_id', $id)->findAll();
        $relatedBlogs = $this->blogModel->where('id !=', $id)->findAll(3);